#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
google_sql_database_instance.dpgraham_postgres: Refreshing state... [id=dpgraham-postgres]
google_compute_network.vpc_network: Refreshing state... [id=projects/dpgraham/global/networks/terraform-network]
google_dns_managed_zone.dpgraham_zone: Refreshing state... [id=projects/dpgraham/managedZones/dpgraham-zone]
google_sql_database.dpgraham_database: Refreshing state... [id=projects/dpgraham/instances/dpgraham-postgres/databases/dpgraham]
google_compute_firewall.default: Refreshing state... [id=projects/dpgraham/global/firewalls/allow-http-traffic]
google_compute_instance.default: Refreshing state... [id=projects/dpgraham/zones/us-east1-b/instances/dns-compute-instance]
google_dns_record_set.tutorial_record_set: Refreshing state... [id=projects/dpgraham/managedZones/dpgraham-zone/rrsets/dpgraham.com./A]
google_sql_user.users: Refreshing state... [id=root//dpgraham-postgres]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_compute_firewall.default will be destroyed
  # (because google_compute_firewall.default is not in configuration)
  - resource "google_compute_firewall" "default" {
      - creation_timestamp      = "2023-07-09T08:21:03.696-07:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = false -> null
      - id                      = "projects/dpgraham/global/firewalls/allow-http-traffic" -> null
      - name                    = "allow-http-traffic" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/dpgraham/global/networks/default" -> null
      - priority                = 1000 -> null
      - project                 = "dpgraham" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/dpgraham/global/firewalls/allow-http-traffic" -> null
      - source_ranges           = [
          - "0.0.0.0/0",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [] -> null

      - allow {
          - ports    = [
              - "80",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.dpgraham_http will be created
  + resource "google_compute_firewall" "dpgraham_http" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-http-traffic"
      + network            = "dpgraham-vpc"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "80",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_instance.default will be destroyed
  # (because google_compute_instance.default is not in configuration)
  - resource "google_compute_instance" "default" {
      - can_ip_forward          = false -> null
      - cpu_platform            = "Intel Broadwell" -> null
      - current_status          = "RUNNING" -> null
      - deletion_protection     = false -> null
      - enable_display          = false -> null
      - guest_accelerator       = [] -> null
      - id                      = "projects/dpgraham/zones/us-east1-b/instances/dns-compute-instance" -> null
      - instance_id             = "5259827205336690720" -> null
      - label_fingerprint       = "42WmSpB8rSM=" -> null
      - labels                  = {} -> null
      - machine_type            = "e2-micro" -> null
      - metadata                = {} -> null
      - metadata_fingerprint    = "x8beEc41ZQI=" -> null
      - metadata_startup_script = <<-EOT
            sudo apt-get update && \
            sudo apt-get install apache2 -y && \
            echo "<!doctype html><html><body><h1>Hello World!</h1></body></html>" > /var/www/html/index.html
        EOT -> null
      - name                    = "dns-compute-instance" -> null
      - project                 = "dpgraham" -> null
      - resource_policies       = [] -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/dpgraham/zones/us-east1-b/instances/dns-compute-instance" -> null
      - tags                    = [] -> null
      - tags_fingerprint        = "42WmSpB8rSM=" -> null
      - zone                    = "us-east1-b" -> null

      - boot_disk {
          - auto_delete = true -> null
          - device_name = "persistent-disk-0" -> null
          - mode        = "READ_WRITE" -> null
          - source      = "https://www.googleapis.com/compute/v1/projects/dpgraham/zones/us-east1-b/disks/dns-compute-instance" -> null

          - initialize_params {
              - image  = "https://www.googleapis.com/compute/v1/projects/ubuntu-os-cloud/global/images/ubuntu-2204-jammy-v20230630" -> null
              - labels = {} -> null
              - size   = 10 -> null
              - type   = "pd-standard" -> null
            }
        }

      - network_interface {
          - name               = "nic0" -> null
          - network            = "https://www.googleapis.com/compute/v1/projects/dpgraham/global/networks/default" -> null
          - network_ip         = "10.142.0.2" -> null
          - queue_count        = 0 -> null
          - stack_type         = "IPV4_ONLY" -> null
          - subnetwork         = "https://www.googleapis.com/compute/v1/projects/dpgraham/regions/us-east1/subnetworks/default" -> null
          - subnetwork_project = "dpgraham" -> null

          - access_config {
              - nat_ip       = "35.237.8.0" -> null
              - network_tier = "PREMIUM" -> null
            }
        }

      - scheduling {
          - automatic_restart   = true -> null
          - min_node_cpus       = 0 -> null
          - on_host_maintenance = "MIGRATE" -> null
          - preemptible         = false -> null
          - provisioning_model  = "STANDARD" -> null
        }

      - shielded_instance_config {
          - enable_integrity_monitoring = true -> null
          - enable_secure_boot          = false -> null
          - enable_vtpm                 = true -> null
        }
    }

  # google_compute_instance.test_apache will be created
  + resource "google_compute_instance" "test_apache" {
      + can_ip_forward          = false
      + cpu_platform            = (known after apply)
      + current_status          = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = <<-EOT
            sudo apt-get update && \
            sudo apt-get install apache2 -y && \
            echo "<!doctype html><html><body><h1>Hello World!</h1></body></html>" > /var/www/html/index.html
        EOT
      + min_cpu_platform        = (known after apply)
      + name                    = "test-apache-instance"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags_fingerprint        = (known after apply)
      + zone                    = "us-east1-b"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2204-lts"
              + labels = (known after apply)
              + size   = (known after apply)
              + type   = (known after apply)
            }
        }

      + network_interface {
          + ipv6_access_type   = (known after apply)
          + name               = (known after apply)
          + network            = "dpgraham-vpc"
          + network_ip         = (known after apply)
          + stack_type         = (known after apply)
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }
    }

  # google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks         = true
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + internal_ipv6_range             = (known after apply)
      + mtu                             = (known after apply)
      + name                            = "dpgraham-vpc"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_network.vpc_network will be destroyed
  # (because google_compute_network.vpc_network is not in configuration)
  - resource "google_compute_network" "vpc_network" {
      - auto_create_subnetworks         = true -> null
      - delete_default_routes_on_create = false -> null
      - enable_ula_internal_ipv6        = false -> null
      - id                              = "projects/dpgraham/global/networks/terraform-network" -> null
      - mtu                             = 0 -> null
      - name                            = "terraform-network" -> null
      - project                         = "dpgraham" -> null
      - routing_mode                    = "REGIONAL" -> null
      - self_link                       = "https://www.googleapis.com/compute/v1/projects/dpgraham/global/networks/terraform-network" -> null
    }

  # google_dns_managed_zone.dpgraham_com will be created
  + resource "google_dns_managed_zone" "dpgraham_com" {
      + creation_time   = (known after apply)
      + description     = "DNS zone following the google create-domain-tutorial"
      + dns_name        = "dpgraham.com."
      + force_destroy   = true
      + id              = (known after apply)
      + managed_zone_id = (known after apply)
      + name            = "dpgraham-zone"
      + name_servers    = (known after apply)
      + project         = (known after apply)
      + visibility      = "public"
    }

  # google_dns_managed_zone.dpgraham_zone will be destroyed
  # (because google_dns_managed_zone.dpgraham_zone is not in configuration)
  - resource "google_dns_managed_zone" "dpgraham_zone" {
      - creation_time   = "2023-07-09T16:05:58.025Z" -> null
      - description     = "DNS zone following the google create-domain-tutorial" -> null
      - dns_name        = "dpgraham.com." -> null
      - force_destroy   = true -> null
      - id              = "projects/dpgraham/managedZones/dpgraham-zone" -> null
      - labels          = {} -> null
      - managed_zone_id = 485607669572715100 -> null
      - name            = "dpgraham-zone" -> null
      - name_servers    = [
          - "ns-cloud-a1.googledomains.com.",
          - "ns-cloud-a2.googledomains.com.",
          - "ns-cloud-a3.googledomains.com.",
          - "ns-cloud-a4.googledomains.com.",
        ] -> null
      - project         = "dpgraham" -> null
      - visibility      = "public" -> null

      - cloud_logging_config {
          - enable_logging = false -> null
        }
    }

  # google_dns_record_set.dpgraham_com_record_set will be created
  + resource "google_dns_record_set" "dpgraham_com_record_set" {
      + id           = (known after apply)
      + managed_zone = "dpgraham-zone"
      + name         = "dpgraham.com."
      + project      = (known after apply)
      + rrdatas      = (known after apply)
      + ttl          = 300
      + type         = "A"
    }

  # google_dns_record_set.tutorial_record_set will be destroyed
  # (because google_dns_record_set.tutorial_record_set is not in configuration)
  - resource "google_dns_record_set" "tutorial_record_set" {
      - id           = "projects/dpgraham/managedZones/dpgraham-zone/rrsets/dpgraham.com./A" -> null
      - managed_zone = "dpgraham-zone" -> null
      - name         = "dpgraham.com." -> null
      - project      = "dpgraham" -> null
      - rrdatas      = [
          - "35.237.8.0",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

  # google_sql_database.dpgraham_database will be destroyed
  # (because google_sql_database.dpgraham_database is not in configuration)
  - resource "google_sql_database" "dpgraham_database" {
      - charset         = "UTF8" -> null
      - collation       = "en_US.UTF8" -> null
      - deletion_policy = "DELETE" -> null
      - id              = "projects/dpgraham/instances/dpgraham-postgres/databases/dpgraham" -> null
      - instance        = "dpgraham-postgres" -> null
      - name            = "dpgraham" -> null
      - project         = "dpgraham" -> null
      - self_link       = "https://sqladmin.googleapis.com/sql/v1beta4/projects/dpgraham/instances/dpgraham-postgres/databases/dpgraham" -> null
    }

  # google_sql_database.dpgraham_sql will be created
  + resource "google_sql_database" "dpgraham_sql" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "dpgraham-postgres"
      + name            = "dpgraham"
      + project         = (known after apply)
      + self_link       = (known after apply)
    }

  # google_sql_database_instance.dpgraham_postgres will be destroyed
  # (because google_sql_database_instance.dpgraham_postgres is not in configuration)
  - resource "google_sql_database_instance" "dpgraham_postgres" {
      - available_maintenance_versions = [] -> null
      - connection_name                = "dpgraham:us-east1:dpgraham-postgres" -> null
      - database_version               = "POSTGRES_14" -> null
      - deletion_protection            = true -> null
      - first_ip_address               = "35.231.83.177" -> null
      - id                             = "dpgraham-postgres" -> null
      - instance_type                  = "CLOUD_SQL_INSTANCE" -> null
      - ip_address                     = [
          - {
              - ip_address     = "35.231.83.177"
              - time_to_retire = ""
              - type           = "PRIMARY"
            },
          - {
              - ip_address     = "35.237.15.233"
              - time_to_retire = ""
              - type           = "OUTGOING"
            },
        ] -> null
      - maintenance_version            = "POSTGRES_14_7.R20230530.01_04" -> null
      - name                           = "dpgraham-postgres" -> null
      - project                        = "dpgraham" -> null
      - public_ip_address              = "35.231.83.177" -> null
      - region                         = "us-east1" -> null
      - self_link                      = "https://sqladmin.googleapis.com/sql/v1beta4/projects/dpgraham/instances/dpgraham-postgres" -> null
      - server_ca_cert                 = [
          - {
              - cert             = <<-EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQ0MGRh
                    NWNkMC0zMGE1LTQ0YjAtYmQ0ZC01NjFjZWFmYmYwODMxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjMwNjE3MDIwMjM4WhcNMzMwNjE0MDIwMzM4WjB3MS0wKwYD
                    VQQuEyQ0MGRhNWNkMC0zMGE1LTQ0YjAtYmQ0ZC01NjFjZWFmYmYwODMxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQDOAk2Uy9YMQXOpNPZmeOcn6Fejkt8qXR+azuCjVfdnR7IrEezSytXLh8WJPAQ/
                    v3yJ9yzNYRmAYyCXLbjE4e8FA7orXKvUMW2qUrQaiCVvi/1uWO9/hxkUwdcUDiLT
                    QbK2zgji0P9TT1uOsombmPdEUugMZE0v+EZW0230PrMnF/rEZGOJBVv8AUsNvWMY
                    WF75fBIzRhO6/Pmyo0uHkYsJ56nvg6ZMn1vGOTba+npOUbK+u4AQ/NVj/n6sRFmg
                    ibUxNs/EQnedXi3VS+Hs7MAdqCdpPOb8iP80Ws7KqacOJzoloAk0gTus3svDlKKg
                    wmprbNuEFwPhyQ7GDnNNBTlxAgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBADGk05fJJx+BCn3lcJFiqQRrt/IWVWu4jWXJ0eVw
                    DyifbbLUQPA2h/W1Hqy+d6d+C2z0uO9jj94F58Md3Fcfwgc07m1fc0QJUDDUe+bc
                    Enpmk1LsiNsAtB8kzQ2pLR56qwiocAv1vw73oZDSNPeOfQcc38VflcyIrO+5YCWR
                    ENxYxjFprGBBoMLby8u8nCz1V31DeRq5O3clzlqL8y8HrDROs+wt1MAJxkvsmy+G
                    CovxqpMcXGUZhPjlN9C2SKj6mS+M1qcAGKZztHr9NSGZEeGPlJ2PwYTWZTGuC3rb
                    PACkakosURROzwiLQW7h6EOm5UNCddCT8txE6a6isNmtjdk=
                    -----END CERTIFICATE-----
                EOT
              - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=40da5cd0-30a5-44b0-bd4d-561ceafbf083"
              - create_time      = "2023-06-17T02:02:38.275Z"
              - expiration_time  = "2033-06-14T02:03:38.275Z"
              - sha1_fingerprint = "565ba210ae5b84d2a0c8d44e2868556356abb3f1"
            },
        ] -> null
      - service_account_email_address  = "p705419979627-5igr4t@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null

      - settings {
          - activation_policy           = "ALWAYS" -> null
          - availability_type           = "ZONAL" -> null
          - connector_enforcement       = "NOT_REQUIRED" -> null
          - deletion_protection_enabled = false -> null
          - disk_autoresize             = true -> null
          - disk_autoresize_limit       = 0 -> null
          - disk_size                   = 10 -> null
          - disk_type                   = "PD_SSD" -> null
          - pricing_plan                = "PER_USE" -> null
          - tier                        = "db-f1-micro" -> null
          - user_labels                 = {} -> null
          - version                     = 22 -> null

          - backup_configuration {
              - binary_log_enabled             = false -> null
              - enabled                        = false -> null
              - point_in_time_recovery_enabled = false -> null
              - start_time                     = "07:00" -> null
              - transaction_log_retention_days = 7 -> null

              - backup_retention_settings {
                  - retained_backups = 7 -> null
                  - retention_unit   = "COUNT" -> null
                }
            }

          - database_flags {
              - name  = "cloudsql.iam_authentication" -> null
              - value = "on" -> null
            }

          - ip_configuration {
              - ipv4_enabled = true -> null
              - require_ssl  = false -> null

              - authorized_networks {
                  - name  = "psql-local" -> null
                  - value = "138.88.251.177" -> null
                }
            }

          - location_preference {
              - zone = "us-east1-d" -> null
            }
        }
    }

  # google_sql_database_instance.staging will be created
  + resource "google_sql_database_instance" "staging" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_14"
      + deletion_protection            = true
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "dpgraham-postgres"
      + private_ip_address             = (known after apply)
      + project                        = "dpgraham"
      + public_ip_address              = (known after apply)
      + region                         = "us-east1"
      + self_link                      = (known after apply)
      + server_ca_cert                 = (known after apply)
      + service_account_email_address  = (known after apply)

      + settings {
          + activation_policy     = "ALWAYS"
          + availability_type     = "ZONAL"
          + connector_enforcement = (known after apply)
          + disk_autoresize       = true
          + disk_autoresize_limit = 0
          + disk_size             = (known after apply)
          + disk_type             = "PD_SSD"
          + pricing_plan          = "PER_USE"
          + tier                  = "db-f1-micro"
          + user_labels           = (known after apply)
          + version               = (known after apply)

          + database_flags {
              + name  = "cloudsql.iam_authentication"
              + value = "on"
            }
        }
    }

Plan: 7 to add, 0 to change, 7 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @dpgraham4401, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*